app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY posts.created_at DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---

<% unless @user.posts.empty? %>

SELECT "replies".* FROM "replies" WHERE "replies"."user_id" = 1 ORDER BY replies.created_at ASC
SELECT COUNT(*) FROM "replies" WHERE "replies"."user_id" = 1
---
<p>
<% unless @user.replies.empty? %>

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 9 ORDER BY posts.created_at DESC LIMIT 1
---
   <% for reply in @user.replies do %>
     <% unique_replies.push(reply.post) unless unique_replies.include?(reply.post)%>