app/views/posts/_post_short.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = 12 ORDER BY replies.created_at ASC
SELECT "users".* FROM "users" WHERE "users"."username" = 'Thor' LIMIT 1
---
    <td class="post_ftr">
    Posted by <%= post.user.username %> at <span class="timestamp"><%= post.created_at %>.  <%= post.replies.length %> replies.</span>