app/views/posts/show.html.erb

  <b>Replies:</b>
  <% @post.replies.each do |reply| %>
---
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = 4 ORDER BY replies.created_at ASC