app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "1"]]

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "1"]]

  def create
    @post = current_user.posts.build(params[:post])
    @post.audio_url = generate_sc_url

    puts "DEBUG"
    puts params[:post]["tags"]

    @post.tag_list = params[:post]["tags"]

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("audio_url", "code_snippet", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("name") VALUES (?)  [["name", "testtag1"]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'Call Your Hacker', "updated_at" = '2011-11-09 06:04:01.752641', "code_snippet" = 'puts "God, I can''t stop listening to Robyn"' WHERE "posts"."id" = 9

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "4"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]