app/controllers/replies_controller.rb

  def create
    # need current post and current user.  Look at create in posts_controller

    @post = Post.find(params[:post_id])
    @user = current_user

    audio_url = generate_sc_url

    @reply = Reply.new(:audio_url => audio_url, :user => current_user, :post => @post)
    @reply.save
    current_user.post_count = current_user.post_count + 1
    current_user.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", :post_id]]
INSERT INTO "replies" ("audio_url", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["audio_url", "This might work!"], ["created_at", Fri, 11 Nov 2011 02:32:20 UTC +00:00], ["post_id", 9], ["updated_at", Fri, 11 Nov 2011 02:32:20 UTC +00:00], ["user_id", 1]]
UPDATE "users" SET "updated_at" = '2011-11-11 18:08:52.679578', "post_count" = 2 WHERE "users"."id" = 1