app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'Thor2' LIMIT 1
---
  def show
    # SKEPTICAL
    if params[:id].nil? and params[:username].nil?
      @user = current_user
    else
      @user = User.find(params[:id]) if !params[:id].nil?
      @user = User.find_by_username(params[:username]) if !params[:username].nil?