app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 05 Nov 2011 20:14:36 UTC +00:00], ["email", "tkell@uvic.ca"], ["password", "testpassword"], ["updated_at", Sat, 05 Nov 2011 20:14:36 UTC +00:00], ["username", "Thor"]]

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "password" = 'testword', "updated_at" = '2011-11-08 04:26:42.703557' WHERE "users"."id" = 4